[
    {
        "id": 1,
        "title": "Cozy 2-Bedroom Condo in Downtown",
        "description": "This modern 2-bedroom, 1.5-bathroom condo offers an open floor plan with abundant natural light, hardwood floors throughout, and a stylish kitchen with stainless steel appliances and granite countertops. The spacious living area leads to a private balcony, perfect for enjoying city views. The master bedroom includes a walk-in closet, while the second bedroom is ideal for a home office or guest space. The building features secured entry, an on-site gym, and a rooftop lounge.",
        "neighborhood_description": "Located in the heart of downtown San Francisco, this condo is within walking distance of trendy cafes, upscale restaurants, and boutique shops. The neighborhood boasts excellent public transportation options, making commuting a breeze. Nearby parks and cultural attractions add to the vibrant urban lifestyle.",
        "location": "San Francisco, CA",
        "neighborhood": "Downtown",
        "property_type": "Condo",
        "year_built": 2010,
        "price": 320000,
        "bedrooms": 2,
        "bathrooms": 1.5,
        "area_sqft": 850,
        "listed_date": "2025-04-01"
    },
    {
        "id": 2,
        "title": "Spacious 4-Bedroom House with Garden",
        "description": "This spacious 4-bedroom, 3-bathroom house offers a large backyard perfect for outdoor activities, a renovated kitchen with modern finishes, and a 2-car garage. The open-concept living and dining area flows seamlessly into the backyard patio, ideal for entertaining. The master suite includes a walk-in closet and en-suite bathroom with a soaking tub and separate shower.",
        "neighborhood_description": "Located in a quiet suburban neighborhood in Austin, TX, this house is close to excellent schools, parks, and shopping centers. The area is family-friendly with a tight-knit community and is just a short drive to downtown Austin for easy access to work and entertainment.",
        "location": "Austin, TX",
        "neighborhood": "Suburban",
        "property_type": "House",
        "year_built": 2015,
        "price": 715000,
        "bedrooms": 4,
        "bathrooms": 3.0,
        "area_sqft": 2100,
        "listed_date": "2025-03-25"
    },
    {
        "id": 3,
        "title": "Modern Studio Apartment Near University",
        "description": "This compact and efficient studio apartment is perfect for students or young professionals. It offers a modern layout with a fully-equipped kitchen, ample closet space, and large windows that provide plenty of natural light. The building features secured access, on-site laundry, and bike storage.",
        "neighborhood_description": "Located just a short walk from the University of Michigan, this studio apartment is ideal for students. The surrounding neighborhood has convenient access to coffee shops, restaurants, and public transportation. The area is lively and safe, offering a great balance between convenience and quiet living.",
        "location": "Ann Arbor, MI",
        "neighborhood": "University District",
        "property_type": "Apartment",
        "year_built": 2010,
        "price": 150000,
        "bedrooms": 0,
        "bathrooms": 1.0,
        "area_sqft": 450,
        "listed_date": "2025-03-28"
    },
    {
        "id": 4,
        "title": "3-Bedroom Townhouse in Family-Friendly Suburb",
        "description": "This charming 3-bedroom, 2.5-bathroom townhouse includes a spacious living area, an updated kitchen, and an attached garage. The home features a private backyard, perfect for outdoor gatherings. Residents also have access to a community pool, providing a relaxing environment for families.",
        "neighborhood_description": "Located in a family-friendly neighborhood in Raleigh, NC, this townhouse is close to parks, schools, and shopping areas. The quiet suburban setting offers a safe and peaceful environment, while still being close to major highways for easy access to downtown Raleigh and surrounding areas.",
        "location": "Raleigh, NC",
        "neighborhood": "Family Suburb",
        "property_type": "Townhouse",
        "year_built": 2012,
        "price": 395000,
        "bedrooms": 3,
        "bathrooms": 2.5,
        "area_sqft": 1600,
        "listed_date": "2025-03-30"
    },
    {
        "id": 5,
        "title": "Luxury Penthouse with City Views",
        "description": "This top-floor penthouse offers stunning panoramic views of the city skyline. With floor-to-ceiling windows, a spacious open floor plan, and rooftop access, the penthouse provides the perfect space for both relaxation and entertaining. The gourmet kitchen features high-end appliances, and the master suite includes a private balcony and luxurious en-suite bathroom with a soaking tub and rain shower.",
        "neighborhood_description": "Located in the heart of Manhattan, this luxury penthouse is within walking distance of Central Park, high-end shopping, fine dining, and vibrant nightlife. The building offers 24-hour concierge service, valet parking, and a fitness center, making it the ultimate in city living.",
        "location": "New York, NY",
        "neighborhood": "Manhattan",
        "property_type": "Penthouse",
        "year_built": 2018,
        "price": 1250000,
        "bedrooms": 3,
        "bathrooms": 3.0,
        "area_sqft": 2400,
        "listed_date": "2025-04-02"
    },
    {
        "id": 6,
        "title": "Charming 1-Bedroom Bungalow",
        "description": "This classic 1-bedroom, 1-bathroom bungalow features an updated kitchen with modern appliances, hardwood floors throughout, and a cozy living room with plenty of natural light. The private patio offers an ideal space for outdoor relaxation and entertaining. This home blends traditional charm with contemporary updates, making it a perfect retreat.",
        "neighborhood_description": "Located in a peaceful residential area of Portland, OR, this bungalow is close to local cafes, parks, and public transportation. The quiet neighborhood offers a suburban vibe while still being within reach of the city’s vibrant downtown.",
        "location": "Portland, OR",
        "neighborhood": "Residential",
        "property_type": "House",
        "year_built": 1940,
        "price": 275000,
        "bedrooms": 1,
        "bathrooms": 1.0,
        "area_sqft": 750,
        "listed_date": "2025-03-22"
    },
    {
        "id": 7,
        "title": "Elegant 2-Bedroom Apartment in High-Rise",
        "description": "This elegant 2-bedroom, 2-bathroom apartment offers a luxurious living experience with a spacious open floor plan, high ceilings, and modern finishes. The kitchen features stainless steel appliances, granite countertops, and a breakfast bar. The building provides concierge service, a fully-equipped gym, and in-unit laundry for added convenience.",
        "neighborhood_description": "Located in the heart of Chicago, IL, this high-rise apartment is within walking distance to shopping centers, fine dining, and cultural landmarks. Public transportation is easily accessible, making commuting a breeze. The building's amenities and prime location provide a perfect urban lifestyle.",
        "location": "Chicago, IL",
        "neighborhood": "Downtown",
        "property_type": "Apartment",
        "year_built": 2015,
        "price": 480000,
        "bedrooms": 2,
        "bathrooms": 2.0,
        "area_sqft": 1000,
        "listed_date": "2025-04-01"
    },
    {
        "id": 8,
        "title": "5-Bedroom Family Home on Cul-de-Sac",
        "description": "This spacious 5-bedroom, 4-bathroom family home offers a finished basement, a large backyard, and a quiet cul-de-sac location. The home features a formal living room, a family room with a fireplace, and an updated kitchen with modern appliances. The fenced yard provides privacy and is perfect for outdoor activities.",
        "neighborhood_description": "Located in a family-friendly neighborhood in Denver, CO, this home is situated on a quiet cul-de-sac, offering peace and privacy. The neighborhood is known for its excellent schools, parks, and nearby shopping centers, making it an ideal location for families.",
        "location": "Denver, CO",
        "neighborhood": "Cul-de-Sac",
        "property_type": "House",
        "year_built": 2005,
        "price": 830000,
        "bedrooms": 5,
        "bathrooms": 4.0,
        "area_sqft": 2800,
        "listed_date": "2025-03-29"
    },
    {
        "id": 9,
        "title": "Compact 1-Bedroom Apartment in Historic Building",
        "description": "This quaint 1-bedroom, 1-bathroom apartment offers vintage charm combined with modern upgrades. The apartment features exposed brick walls, hardwood floors, and a fully renovated kitchen with stainless steel appliances. It is perfect for those looking for a cozy living space with character.",
        "neighborhood_description": "Situated in a historic district of Boston, MA, this apartment is surrounded by charming architecture, local cafes, and shops. The neighborhood is vibrant, with easy access to public transportation and close proximity to cultural attractions like museums and theaters.",
        "location": "Boston, MA",
        "neighborhood": "Historic District",
        "property_type": "Apartment",
        "year_built": 1900,
        "price": 210000,
        "bedrooms": 1,
        "bathrooms": 1.0,
        "area_sqft": 600,
        "listed_date": "2025-03-31"
    },
    {
        "id": 10,
        "title": "3-Bedroom Cabin Near the Lake",
        "description": "This rustic-style 3-bedroom, 2-bathroom cabin offers stunning views of the lake, a cozy fireplace, and a spacious deck perfect for outdoor entertaining. The cabin features wood-paneled interiors, an open-concept living space, and a fully equipped kitchen. It provides the ideal getaway for those seeking tranquility and natural beauty.",
        "neighborhood_description": "Nestled near Lake Tahoe, CA, this cabin is surrounded by breathtaking natural landscapes, including hiking trails and ski resorts. The peaceful, secluded location offers the perfect retreat from the hustle and bustle of city life, while still being easily accessible to outdoor activities.",
        "location": "Lake Tahoe, CA",
        "neighborhood": "Lakefront",
        "property_type": "Cabin",
        "year_built": 2000,
        "price": 460000,
        "bedrooms": 3,
        "bathrooms": 2.0,
        "area_sqft": 1400,
        "listed_date": "2025-03-27"
    },
    {
        "id": 11,
        "title": "Charming 3-Bedroom Cottage by the Beach",
        "description": "This cozy 3-bedroom, 2-bathroom cottage offers beachside living with a spacious open floor plan, a stone fireplace, and large windows providing scenic views of the ocean. The updated kitchen includes stainless steel appliances, while the master suite features a private balcony overlooking the beach. The property also has a wraparound porch, perfect for enjoying the ocean breeze.",
        "neighborhood_description": "Located in a peaceful beach community in Santa Cruz, CA, this cottage offers the perfect balance of tranquility and convenience. The neighborhood is just a short walk from the beach and local eateries, while also being close to parks and outdoor activities.",
        "location": "Santa Cruz, CA",
        "neighborhood": "Beachside",
        "property_type": "Cottage",
        "year_built": 1985,
        "price": 850000,
        "bedrooms": 3,
        "bathrooms": 2.0,
        "area_sqft": 1600,
        "listed_date": "2025-04-05"
    },
    {
        "id": 12,
        "title": "Sleek 2-Bedroom Loft in the Arts District",
        "description": "This modern 2-bedroom, 2-bathroom loft is located in the vibrant Arts District of Los Angeles. The open-concept design features high ceilings, polished concrete floors, and large windows that flood the space with natural light. The kitchen boasts stainless steel appliances and a breakfast bar, while the living area is perfect for entertaining guests.",
        "neighborhood_description": "Situated in the heart of Los Angeles' Arts District, this loft is surrounded by art galleries, trendy cafes, and boutique shops. The neighborhood offers a lively urban environment with easy access to public transportation, making it an ideal location for city living.",
        "location": "Los Angeles, CA",
        "neighborhood": "Arts District",
        "property_type": "Loft",
        "year_built": 2010,
        "price": 720000,
        "bedrooms": 2,
        "bathrooms": 2.0,
        "area_sqft": 1100,
        "listed_date": "2025-04-06"
    },
    {
        "id": 13,
        "title": "Cozy 2-Bedroom Cottage in the Countryside",
        "description": "This charming 2-bedroom, 1-bathroom cottage is perfect for those looking to escape the hustle and bustle of city life. The home features a traditional stone fireplace, a cozy living room, and a country-style kitchen with vintage fixtures. The expansive backyard provides space for gardening and outdoor gatherings.",
        "neighborhood_description": "Located in a serene countryside setting just outside of Asheville, NC, this cottage offers peace and privacy. The neighborhood is known for its beautiful rolling hills, local farms, and hiking trails, making it a perfect location for nature lovers.",
        "location": "Asheville, NC",
        "neighborhood": "Countryside",
        "property_type": "Cottage",
        "year_built": 1950,
        "price": 350000,
        "bedrooms": 2,
        "bathrooms": 1.0,
        "area_sqft": 950,
        "listed_date": "2025-04-07"
    },
    {
        "id": 14,
        "title": "Stylish 1-Bedroom Condo with City Views",
        "description": "This chic 1-bedroom, 1-bathroom condo offers sweeping views of the city skyline from its floor-to-ceiling windows. The open-plan living area includes a modern kitchen with sleek appliances and a breakfast bar. The bedroom has ample closet space, while the bathroom features elegant finishes and a walk-in shower.",
        "neighborhood_description": "Located in the heart of downtown Seattle, WA, this condo is close to major office buildings, shopping districts, and public transit options. The neighborhood offers a perfect urban lifestyle, with restaurants, entertainment venues, and parks just minutes away.",
        "location": "Seattle, WA",
        "neighborhood": "Downtown",
        "property_type": "Condo",
        "year_built": 2017,
        "price": 550000,
        "bedrooms": 1,
        "bathrooms": 1.0,
        "area_sqft": 750,
        "listed_date": "2025-04-08"
    },
    {
        "id": 15,
        "title": "Luxury 4-Bedroom Villa with Pool",
        "description": "This stunning 4-bedroom, 4-bathroom villa offers a spacious layout with high-end finishes, including marble floors, designer kitchen with premium appliances, and a large open living area with panoramic views. The outdoor space features a private pool, lush garden, and multiple terraces for relaxation and entertaining.",
        "neighborhood_description": "Situated in an exclusive gated community in Miami, FL, this villa offers both privacy and luxury. The neighborhood is known for its upscale homes, top-rated golf courses, and proximity to the beach. Residents also enjoy convenient access to world-class shopping and dining.",
        "location": "Miami, FL",
        "neighborhood": "Gated Community",
        "property_type": "Villa",
        "year_built": 2020,
        "price": 2200000,
        "bedrooms": 4,
        "bathrooms": 4.0,
        "area_sqft": 4500,
        "listed_date": "2025-04-09"
    },
    {
        "id": 16,
        "title": "Affordable 2-Bedroom Mobile Home in Quiet Rural Area",
        "description": "This 2-bedroom, 1-bathroom mobile home offers a comfortable living space with a cozy living room, functional kitchen, and a large backyard perfect for outdoor activities. While compact, the home provides a peaceful and private environment for those seeking a simple, affordable lifestyle.",
        "neighborhood_description": "Located in a peaceful rural area of eastern Oregon, this mobile home offers the perfect escape from city life. The neighborhood is quiet and ideal for those who enjoy country living, with scenic views of rolling hills and wide-open spaces.",
        "location": "Baker City, OR",
        "neighborhood": "Rural Area",
        "property_type": "Mobile Home",
        "year_built": 1995,
        "price": 85000,
        "bedrooms": 2,
        "bathrooms": 1.0,
        "area_sqft": 600,
        "listed_date": "2025-04-10"
    },
    {
        "id": 17,
        "title": "Rustic 3-Bedroom Cabin in the Mountains",
        "description": "This charming 3-bedroom, 2-bathroom cabin offers rustic living with wood beams, a stone fireplace, and large windows showcasing breathtaking mountain views. The open kitchen and dining area provide a cozy space for family meals, while the wraparound porch is perfect for enjoying the serene surroundings.",
        "neighborhood_description": "Located in the remote mountain area of western Montana, this cabin is perfect for nature lovers. The surrounding forest offers endless opportunities for hiking, fishing, and wildlife watching. While secluded, the property is just a short drive from local amenities.",
        "location": "Helena, MT",
        "neighborhood": "Mountain Retreat",
        "property_type": "Cabin",
        "year_built": 1980,
        "price": 290000,
        "bedrooms": 3,
        "bathrooms": 2.0,
        "area_sqft": 1300,
        "listed_date": "2025-04-11"
    },
    {
        "id": 18,
        "title": "Charming 1-Bedroom Cottage in Secluded Forest",
        "description": "This one-bedroom, one-bathroom cottage is perfect for those seeking a peaceful, secluded retreat. The home features a cozy interior with wood accents, a small but functional kitchen, and a living room with a fireplace. A private deck overlooks a tranquil forest, offering total privacy and serenity.",
        "neighborhood_description": "Nestled deep in the forests of the Adirondacks in upstate New York, this cottage provides a quiet escape from the hustle and bustle. Surrounded by nature, the neighborhood is perfect for outdoor enthusiasts who love hiking, birdwatching, and fishing.",
        "location": "Lake Placid, NY",
        "neighborhood": "Secluded Forest",
        "property_type": "Cottage",
        "year_built": 1965,
        "price": 125000,
        "bedrooms": 1,
        "bathrooms": 1.0,
        "area_sqft": 800,
        "listed_date": "2025-04-12"
    },
    {
        "id": 19,
        "title": "Spacious 4-Bedroom Home on a Large Lot in Small Town",
        "description": "This 4-bedroom, 2.5-bathroom home offers a large backyard, an open-concept living space, and a well-equipped kitchen. The master bedroom includes an en-suite bathroom and walk-in closet, and the other bedrooms are spacious, ideal for a growing family. The large lot provides plenty of room for gardening or outdoor projects.",
        "neighborhood_description": "Located in the quiet town of Lafayette, Indiana, this home offers a slower pace of life while still being within driving distance of larger cities. The neighborhood is family-friendly, with local parks and schools nearby, making it an ideal choice for families looking for more space without the city price tag.",
        "location": "Lafayette, IN",
        "neighborhood": "Small Town",
        "property_type": "House",
        "year_built": 2005,
        "price": 225000,
        "bedrooms": 4,
        "bathrooms": 2.5,
        "area_sqft": 2200,
        "listed_date": "2025-04-13"
    },
    {
        "id": 20,
        "title": "Budget-Friendly 2-Bedroom Apartment in Suburban Area",
        "description": "This 2-bedroom, 1-bathroom apartment is an affordable option for those looking to own property in a suburban area. The unit offers a functional layout with a large living room, kitchen with basic appliances, and two comfortable bedrooms. Perfect for first-time homebuyers or those on a budget.",
        "neighborhood_description": "Located in the suburban neighborhood of Toledo, Ohio, this apartment provides easy access to local shops, schools, and parks. The quiet and safe environment is ideal for young families or anyone looking for an affordable place to live near the city center.",
        "location": "Toledo, OH",
        "neighborhood": "Suburban Area",
        "property_type": "Apartment",
        "year_built": 1990,
        "price": 65000,
        "bedrooms": 2,
        "bathrooms": 1.0,
        "area_sqft": 800,
        "listed_date": "2025-04-14"
    },
    {
        "id": 21,
        "title": "Stunning 2-Bedroom Loft with Exposed Brick Walls",
        "description": "This unique 2-bedroom, 2-bathroom loft features high ceilings, large windows with panoramic city views, and exposed brick walls that add character and charm. The open-concept layout is perfect for entertaining, and the modern kitchen includes stainless steel appliances, a breakfast bar, and granite countertops. The loft also offers a private rooftop terrace, ideal for outdoor gatherings and enjoying sunsets.",
        "neighborhood_description": "Located in a trendy arts district of Chicago, this loft is surrounded by galleries, cafes, and boutique shops. The neighborhood has a vibrant atmosphere, with regular cultural events and easy access to public transportation. Ideal for creative professionals and those who appreciate urban living.",
        "location": "Chicago, IL",
        "neighborhood": "Arts District",
        "property_type": "Loft",
        "year_built": 1920,
        "price": 680000,
        "bedrooms": 2,
        "bathrooms": 2.0,
        "area_sqft": 1500,
        "listed_date": "2025-04-15"
    },
    {
        "id": 22,
        "title": "Eco-Friendly 3-Bedroom Home with Solar Panels",
        "description": "This eco-conscious 3-bedroom, 2-bathroom home is equipped with solar panels to reduce your carbon footprint and save on energy costs. The home features a spacious living room with energy-efficient windows, a fully updated kitchen with recycled materials, and a backyard garden with a rainwater collection system. The property also includes a detached office space for remote work or creative projects.",
        "neighborhood_description": "Located in a quiet suburban neighborhood in Boulder, Colorado, this home is close to parks and hiking trails, perfect for outdoor enthusiasts. The community is known for its focus on sustainability, with many eco-friendly initiatives and green spaces.",
        "location": "Boulder, CO",
        "neighborhood": "Sustainable Community",
        "property_type": "House",
        "year_built": 2015,
        "price": 675000,
        "bedrooms": 3,
        "bathrooms": 2.0,
        "area_sqft": 2000,
        "listed_date": "2025-04-16"
    },
    {
        "id": 23,
        "title": "Historic 4-Bedroom Mansion with Private Library",
        "description": "This grand 4-bedroom, 4-bathroom mansion boasts original 19th-century architecture, including marble floors, intricate woodwork, and stained glass windows. The highlight of this property is the private library, which features floor-to-ceiling bookshelves and a cozy reading nook. The home also includes a formal dining room, multiple living areas, and a beautifully landscaped garden with a fountain.",
        "neighborhood_description": "Situated in a prestigious historic neighborhood in Charleston, South Carolina, this mansion is surrounded by beautifully preserved homes and lush gardens. The area offers a quiet, refined atmosphere, with easy access to top restaurants, art galleries, and museums.",
        "location": "Charleston, SC",
        "neighborhood": "Historic District",
        "property_type": "Mansion",
        "year_built": 1890,
        "price": 3500000,
        "bedrooms": 4,
        "bathrooms": 4.0,
        "area_sqft": 5500,
        "listed_date": "2025-04-17"
    },
    {
        "id": 24,
        "title": "Contemporary 2-Bedroom Condo with Home Theater",
        "description": "This modern 2-bedroom, 2-bathroom condo features a state-of-the-art home theater system, perfect for movie lovers. The open-concept living area is equipped with high-end finishes, including a gourmet kitchen with quartz countertops, a spacious living room with a fireplace, and a dining area with stunning views. The building offers premium amenities like a rooftop pool, a fitness center, and 24-hour concierge service.",
        "neighborhood_description": "Located in the heart of downtown Los Angeles, this condo is within walking distance to entertainment venues, upscale dining, and cultural attractions. The neighborhood has a vibrant, cosmopolitan feel, with a wide range of activities and entertainment options.",
        "location": "Los Angeles, CA",
        "neighborhood": "Downtown",
        "property_type": "Condo",
        "year_built": 2020,
        "price": 950000,
        "bedrooms": 2,
        "bathrooms": 2.0,
        "area_sqft": 1200,
        "listed_date": "2025-04-18"
    },
    {
        "id": 25,
        "title": "Luxury 5-Bedroom Villa with Infinity Pool and Ocean Views",
        "description": "This exquisite 5-bedroom, 5-bathroom villa offers luxurious living with breathtaking ocean views. The property features an infinity pool, a hot tub, and expansive outdoor living areas perfect for entertaining. Inside, the villa boasts a chef’s kitchen, an expansive living room with panoramic windows, and a master suite with a private balcony. The property also includes a wine cellar, home gym, and a private movie theater.",
        "neighborhood_description": "Situated in a prime location along the coast of Malibu, California, this villa offers privacy and seclusion while being close to world-renowned beaches, restaurants, and shopping. The neighborhood is known for its luxurious homes and tranquil atmosphere.",
        "location": "Malibu, CA",
        "neighborhood": "Coastal Luxury",
        "property_type": "Villa",
        "year_built": 2018,
        "price": 8500000,
        "bedrooms": 5,
        "bathrooms": 5.0,
        "area_sqft": 7500,
        "listed_date": "2025-04-19"
    },
    {
        "id": 26,
        "title": "Eco-Friendly 3-Bedroom Home with Solar Panels",
        "description": "This energy-efficient 3-bedroom, 2-bathroom home is equipped with solar panels and a rainwater collection system to reduce utility costs. The open-plan living area includes a modern kitchen with energy-saving appliances and a spacious living room. The large backyard features a garden with native plants and a patio perfect for outdoor entertaining.",
        "neighborhood_description": "Situated in a sustainable community in Boulder, CO, this home is surrounded by green spaces and is close to hiking trails and local farmers' markets. The neighborhood promotes eco-friendly living with community composting and bike-sharing programs.",
        "location": "Boulder, CO",
        "neighborhood": "Sustainable Community",
        "property_type": "House",
        "year_built": 2023,
        "price": 650000,
        "bedrooms": 3,
        "bathrooms": 2.0,
        "area_sqft": 1800,
        "listed_date": "2025-04-15"
    },
    {
        "id": 27,
        "title": "Historic 2-Bedroom Loft in Former Factory",
        "description": "This unique 2-bedroom, 1.5-bathroom loft is located in a beautifully restored historic factory building. The high ceilings and exposed brick walls add industrial charm, while the large windows offer plenty of natural light. The open kitchen features modern appliances, and the spacious living area is perfect for entertaining guests.",
        "neighborhood_description": "Located in the heart of Pittsburgh’s cultural district, this loft is surrounded by art galleries, theaters, and trendy cafes. The neighborhood combines old-world charm with modern amenities, offering a lively, creative atmosphere.",
        "location": "Pittsburgh, PA",
        "neighborhood": "Cultural District",
        "property_type": "Loft",
        "year_built": 1910,
        "price": 395000,
        "bedrooms": 2,
        "bathrooms": 1.5,
        "area_sqft": 1400,
        "listed_date": "2025-04-16"
    },
    {
        "id": 28,
        "title": "5-Bedroom Smart Home with Automated Features",
        "description": "This state-of-the-art 5-bedroom, 4-bathroom smart home features the latest home automation technology, including voice-activated lighting, security systems, and climate control. The home also has a home theater room, an indoor swimming pool, and a fully equipped kitchen with smart appliances. The garage has electric car charging stations.",
        "neighborhood_description": "Located in a modern, tech-savvy neighborhood in Austin, TX, this smart home is part of a growing community of innovative homes. The area is well-connected with fiber optic internet and is close to tech hubs and co-working spaces.",
        "location": "Austin, TX",
        "neighborhood": "Tech Community",
        "property_type": "Smart Home",
        "year_built": 2024,
        "price": 1500000,
        "bedrooms": 5,
        "bathrooms": 4.0,
        "area_sqft": 4500,
        "listed_date": "2025-04-17"
    },
    {
        "id": 29,
        "title": "Luxury 4-Bedroom Home with Private Vineyard",
        "description": "This stunning 4-bedroom, 3.5-bathroom home includes a private vineyard, perfect for wine enthusiasts. The spacious home boasts a gourmet kitchen, an open-concept living area with vaulted ceilings, and a master suite with a private terrace. The outdoor space features a pool, hot tub, and multiple areas for relaxation and outdoor dining.",
        "neighborhood_description": "Nestled in the rolling hills of Napa Valley, CA, this property offers both seclusion and access to world-class wineries. The neighborhood is known for its luxury estates, wineries, and scenic views, making it a sought-after location for those who appreciate fine wine and a tranquil lifestyle.",
        "location": "Napa Valley, CA",
        "neighborhood": "Vineyard Estate",
        "property_type": "House",
        "year_built": 2018,
        "price": 3200000,
        "bedrooms": 4,
        "bathrooms": 3.5,
        "area_sqft": 3500,
        "listed_date": "2025-04-18"
    },
    {
        "id": 30,
        "title": "Converted 3-Bedroom Schoolhouse with Large Garden",
        "description": "This one-of-a-kind 3-bedroom, 2-bathroom home was converted from a historic schoolhouse, retaining original architectural features like tall windows and hardwood floors. The spacious kitchen opens to a large garden with fruit trees and a vegetable patch. The home includes a library nook, a study, and an outdoor patio for dining.",
        "neighborhood_description": "Located in a charming small town in Vermont, this home is set in a quiet, close-knit neighborhood with easy access to hiking trails and local markets. The area is perfect for those seeking a slower pace of life while being close to cultural events and community gatherings.",
        "location": "Burlington, VT",
        "neighborhood": "Historic Town",
        "property_type": "Converted Schoolhouse",
        "year_built": 1925,
        "price": 425000,
        "bedrooms": 3,
        "bathrooms": 2.0,
        "area_sqft": 2400,
        "listed_date": "2025-04-19"
    }
]